<?xml version="1.0"?>
<net name="pfe" version="10">
	<layers>
		<layer id="7" name="pillar_x" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_x">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="pillar_y" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_y">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="pillar_z" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_z">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="pillar_i" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_i">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="num_points_per_pillar" type="Parameter" version="opset1">
			<data shape="1,12000" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="num_points_per_pillar">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="x_sub_shaped" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x_sub_shaped">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="y_sub_shaped" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="y_sub_shaped">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="mask" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="mask">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Convert_68" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Convert_68/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="10" name="Convert_68/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="11" name="Convert_68/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="12" name="Convert_68/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="13" name="Convert_68/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Convert_70" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Convert_70/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="4" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="16" name="Convert_70/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="6" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="17" name="Convert_70/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="4" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="18" name="Convert_70/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="6" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="19" name="Convert_70/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Convert_72" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convert_72/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="8" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="22" name="Convert_72/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="10" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="23" name="Convert_72/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="8" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="24" name="Convert_72/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="10" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="25" name="Convert_72/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Convert_74" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Convert_74/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="28" name="Convert_74/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="12" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="29" name="Convert_74/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="30" name="Convert_74/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="12" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="31" name="Convert_74/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Concat_9" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Concat_0" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="ReduceSum_1/Cast_1765_const" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="ReduceSum_1" type="ReduceSum" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="ReduceSum_1/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="22" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="37" name="ReduceSum_1/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="24" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="38" name="ReduceSum_1/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="22" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="39" name="ReduceSum_1/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="24" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="40" name="ReduceSum_1/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Convert_76" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Convert_76/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="43" name="Convert_76/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="26" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="44" name="Convert_76/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="45" name="Convert_76/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="26" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="46" name="Convert_76/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_3/Cast_1763_const" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="28" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Div_4/reciprocal__input_port_1/value328389/EltwiseUnsqueeze402_const" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="60" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Div_4/reciprocal_" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Div_4/reciprocal_/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="52" name="Div_4/reciprocal_/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="62" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="53" name="Div_4/reciprocal_/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="54" name="Div_4/reciprocal_/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="62" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="55" name="Div_4/reciprocal_/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Div_4" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Div_4/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="58" name="Div_4/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="64" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="59" name="Div_4/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="60" name="Div_4/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="64" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="61" name="Div_4/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Sub_5/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Sub_5/sub/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="64" name="Sub_5/sub/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="64" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="65" name="Sub_5/sub/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="66" name="Sub_5/sub/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="64" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="67" name="Sub_5/sub/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Convert_78" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Convert_78/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="70" name="Convert_78/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="71" name="Convert_78/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="72" name="Convert_78/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="73" name="Convert_78/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Sub_6/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Sub_6/sub/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="66" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="76" name="Sub_6/sub/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="77" name="Sub_6/sub/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="66" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="78" name="Sub_6/sub/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="79" name="Sub_6/sub/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Convert_80" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Convert_80/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="68" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="82" name="Convert_80/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="70" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="83" name="Convert_80/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="68" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="84" name="Convert_80/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="70" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="85" name="Convert_80/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Sub_7/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Sub_7/sub/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="68" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="88" name="Sub_7/sub/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="70" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="89" name="Sub_7/sub/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="68" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="90" name="Sub_7/sub/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="70" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="91" name="Sub_7/sub/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Concat_8" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Concat_10" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Convert_82" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Convert_82/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="96" name="Convert_82/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="72" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="97" name="Convert_82/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="98" name="Convert_82/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="72" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="99" name="Convert_82/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Mul_11" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Mul_11/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="66" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="102" name="Mul_11/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="103" name="Mul_11/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="66" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="104" name="Mul_11/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="105" name="Mul_11/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_23447" type="Const" version="opset1">
			<data element_type="i8" shape="64, 9, 1, 1" offset="74" size="576" />
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Convert_23448" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_23449" type="Const" version="opset1">
			<data element_type="f16" shape="64, 1, 1, 1" offset="650" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_12/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_12/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="data_add_382394/EltwiseUnsqueeze422_const" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="778" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_12/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Relu_14" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Relu_14/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="115" name="Relu_14/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="906" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="116" name="Relu_14/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="117" name="Relu_14/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="906" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="118" name="Relu_14/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16" />
				<port id="2" precision="FP16" />
				<port id="3" precision="FP16" />
				<port id="4" precision="FP16" />
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_23451" type="Const" version="opset1">
			<data element_type="i8" shape="64, 64, 1, 34" offset="908" size="139264" />
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Convert_23452" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_23453" type="Const" version="opset1">
			<data element_type="f16" shape="64, 1, 1, 1" offset="140172" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Conv_15/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Conv_15/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 3" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Conv_15/Dims221388/EltwiseUnsqueeze398_const" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="140300" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Add_64" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="174" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="174">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="174/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="94" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="80" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="68" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="41" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="26" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="20" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="14" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="13" to-port="1" />
		<edge from-layer="10" from-port="0" to-layer="13" to-port="2" />
		<edge from-layer="11" from-port="0" to-layer="13" to-port="3" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="4" />
		<edge from-layer="13" from-port="5" to-layer="74" to-port="0" />
		<edge from-layer="13" from-port="5" to-layer="33" to-port="0" />
		<edge from-layer="13" from-port="5" to-layer="32" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="19" to-port="1" />
		<edge from-layer="16" from-port="0" to-layer="19" to-port="2" />
		<edge from-layer="17" from-port="0" to-layer="19" to-port="3" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="4" />
		<edge from-layer="19" from-port="5" to-layer="86" to-port="0" />
		<edge from-layer="19" from-port="5" to-layer="32" to-port="1" />
		<edge from-layer="19" from-port="5" to-layer="33" to-port="1" />
		<edge from-layer="20" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="21" from-port="0" to-layer="25" to-port="1" />
		<edge from-layer="22" from-port="0" to-layer="25" to-port="2" />
		<edge from-layer="23" from-port="0" to-layer="25" to-port="3" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="4" />
		<edge from-layer="25" from-port="5" to-layer="32" to-port="2" />
		<edge from-layer="25" from-port="5" to-layer="33" to-port="2" />
		<edge from-layer="26" from-port="1" to-layer="31" to-port="0" />
		<edge from-layer="27" from-port="0" to-layer="31" to-port="1" />
		<edge from-layer="28" from-port="0" to-layer="31" to-port="2" />
		<edge from-layer="29" from-port="0" to-layer="31" to-port="3" />
		<edge from-layer="30" from-port="0" to-layer="31" to-port="4" />
		<edge from-layer="31" from-port="5" to-layer="32" to-port="3" />
		<edge from-layer="32" from-port="4" to-layer="93" to-port="0" />
		<edge from-layer="33" from-port="3" to-layer="35" to-port="0" />
		<edge from-layer="33" from-port="3" to-layer="62" to-port="0" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="1" />
		<edge from-layer="35" from-port="2" to-layer="40" to-port="0" />
		<edge from-layer="36" from-port="0" to-layer="40" to-port="1" />
		<edge from-layer="37" from-port="0" to-layer="40" to-port="2" />
		<edge from-layer="38" from-port="0" to-layer="40" to-port="3" />
		<edge from-layer="39" from-port="0" to-layer="40" to-port="4" />
		<edge from-layer="40" from-port="5" to-layer="56" to-port="0" />
		<edge from-layer="41" from-port="1" to-layer="46" to-port="0" />
		<edge from-layer="42" from-port="0" to-layer="46" to-port="1" />
		<edge from-layer="43" from-port="0" to-layer="46" to-port="2" />
		<edge from-layer="44" from-port="0" to-layer="46" to-port="3" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="4" />
		<edge from-layer="46" from-port="5" to-layer="48" to-port="0" />
		<edge from-layer="47" from-port="0" to-layer="48" to-port="1" />
		<edge from-layer="48" from-port="2" to-layer="50" to-port="0" />
		<edge from-layer="49" from-port="0" to-layer="50" to-port="1" />
		<edge from-layer="50" from-port="2" to-layer="55" to-port="0" />
		<edge from-layer="51" from-port="0" to-layer="55" to-port="1" />
		<edge from-layer="52" from-port="0" to-layer="55" to-port="2" />
		<edge from-layer="53" from-port="0" to-layer="55" to-port="3" />
		<edge from-layer="54" from-port="0" to-layer="55" to-port="4" />
		<edge from-layer="55" from-port="5" to-layer="56" to-port="1" />
		<edge from-layer="56" from-port="2" to-layer="61" to-port="0" />
		<edge from-layer="57" from-port="0" to-layer="61" to-port="1" />
		<edge from-layer="58" from-port="0" to-layer="61" to-port="2" />
		<edge from-layer="59" from-port="0" to-layer="61" to-port="3" />
		<edge from-layer="60" from-port="0" to-layer="61" to-port="4" />
		<edge from-layer="61" from-port="5" to-layer="62" to-port="1" />
		<edge from-layer="62" from-port="2" to-layer="67" to-port="0" />
		<edge from-layer="63" from-port="0" to-layer="67" to-port="1" />
		<edge from-layer="64" from-port="0" to-layer="67" to-port="2" />
		<edge from-layer="65" from-port="0" to-layer="67" to-port="3" />
		<edge from-layer="66" from-port="0" to-layer="67" to-port="4" />
		<edge from-layer="67" from-port="5" to-layer="93" to-port="1" />
		<edge from-layer="68" from-port="1" to-layer="73" to-port="0" />
		<edge from-layer="69" from-port="0" to-layer="73" to-port="1" />
		<edge from-layer="70" from-port="0" to-layer="73" to-port="2" />
		<edge from-layer="71" from-port="0" to-layer="73" to-port="3" />
		<edge from-layer="72" from-port="0" to-layer="73" to-port="4" />
		<edge from-layer="73" from-port="5" to-layer="74" to-port="1" />
		<edge from-layer="74" from-port="2" to-layer="79" to-port="0" />
		<edge from-layer="75" from-port="0" to-layer="79" to-port="1" />
		<edge from-layer="76" from-port="0" to-layer="79" to-port="2" />
		<edge from-layer="77" from-port="0" to-layer="79" to-port="3" />
		<edge from-layer="78" from-port="0" to-layer="79" to-port="4" />
		<edge from-layer="79" from-port="5" to-layer="92" to-port="0" />
		<edge from-layer="80" from-port="1" to-layer="85" to-port="0" />
		<edge from-layer="81" from-port="0" to-layer="85" to-port="1" />
		<edge from-layer="82" from-port="0" to-layer="85" to-port="2" />
		<edge from-layer="83" from-port="0" to-layer="85" to-port="3" />
		<edge from-layer="84" from-port="0" to-layer="85" to-port="4" />
