<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="7" name="pillar_x" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_x">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="pillar_y" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_y">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="pillar_z" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_z">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="pillar_i" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_i">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="num_points_per_pillar" type="Parameter" version="opset1">
			<data shape="1,12000" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="num_points_per_pillar">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="x_sub_shaped" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x_sub_shaped">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="y_sub_shaped" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="y_sub_shaped">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="mask" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="mask">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/voxel_feature_extractor/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/voxel_feature_extractor/Concat_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::ReduceSum_160">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/voxel_feature_extractor/ReduceSum" type="ReduceSum" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/ReduceSum_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/voxel_feature_extractor/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/voxel_feature_extractor/Constant_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/voxel_feature_extractor/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Reshape_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/voxel_feature_extractor/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Div_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/voxel_feature_extractor/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Sub_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/voxel_feature_extractor/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Sub_1_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/voxel_feature_extractor/Sub_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Sub_2_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/voxel_feature_extractor/Concat_1" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32" names="/voxel_feature_extractor/Concat_1_output_0">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/voxel_feature_extractor/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Mul_output_0">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="onnx::Conv_175_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 9, 1, 1" offset="40" size="1152" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_175">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="onnx::Conv_175" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/voxel_feature_extractor/pfn_layers.0/conv1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_36_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="1192" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_36" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/voxel_feature_extractor/pfn_layers.0/conv1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/pfn_layers.0/conv1/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/voxel_feature_extractor/pfn_layers.0/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/voxel_feature_extractor/pfn_layers.0/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="voxel_feature_extractor.pfn_layers.0.conv3.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 1, 34" offset="1320" size="278528" />
			<output>
				<port id="0" precision="FP16" names="voxel_feature_extractor.pfn_layers.0.conv3.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="voxel_feature_extractor.pfn_layers.0.conv3.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/voxel_feature_extractor/pfn_layers.0/conv3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 3" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_53_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="279848" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_53" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="173" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="173">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="173/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="18" to-port="1" />
		<edge from-layer="1" from-port="0" to-layer="16" to-port="1" />
		<edge from-layer="2" from-port="0" to-layer="15" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="12" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="17" to-port="3" />
		<edge from-layer="5" from-port="0" to-layer="8" to-port="2" />
		<edge from-layer="5" from-port="0" to-layer="17" to-port="2" />
		<edge from-layer="6" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="6" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="6" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="15" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="17" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="3" to-layer="14" to-port="0" />
		<edge from-layer="8" from-port="3" to-layer="10" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="13" to-port="1" />
		<edge from-layer="13" from-port="2" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="17" to-port="4" />
		<edge from-layer="15" from-port="2" to-layer="17" to-port="5" />
		<edge from-layer="16" from-port="2" to-layer="17" to-port="6" />
		<edge from-layer="17" from-port="7" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="24" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1" />
		<edge from-layer="24" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="26" from-port="0" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="28" to-port="1" />
		<edge from-layer="28" from-port="2" to-layer="31" to-port="0" />
		<edge from-layer="29" from-port="0" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="31" to-port="1" />
		<edge from-layer="31" from-port="2" to-layer="32" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2024.3.0-16041-1e3b88e4e3f-releases/2024/3" />
		<conversion_parameters>
			<is_python_object value="False" />
			<output_model value="pfe" />
		</conversion_parameters>
	</rt_info>
</net>
