<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="7" name="pillar_x" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_x">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="pillar_y" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_y">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="pillar_z" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_z">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="pillar_i" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pillar_i">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="num_points_per_pillar" type="Parameter" version="opset1">
			<data shape="1,12000" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="num_points_per_pillar">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="x_sub_shaped" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x_sub_shaped">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="y_sub_shaped" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="y_sub_shaped">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="mask" type="Parameter" version="opset1">
			<data shape="1,1,12000,100" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="mask">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="pillar_x/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="9" name="pillar_x/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="10" name="pillar_x/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="11" name="pillar_x/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="12" name="pillar_x/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="pillar_y/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="8" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="14" name="pillar_y/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="15" name="pillar_y/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="8" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="16" name="pillar_y/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="17" name="pillar_y/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="pillar_z/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="16" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="19" name="pillar_z/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="20" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="20" name="pillar_z/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="16" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="21" name="pillar_z/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="20" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="22" name="pillar_z/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="pillar_i/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="24" name="pillar_i/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="24" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="25" name="pillar_i/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="26" name="pillar_i/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="24" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="27" name="pillar_i/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/voxel_feature_extractor/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/voxel_feature_extractor/Concat_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="28" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::ReduceSum_160">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/voxel_feature_extractor/ReduceSum" type="ReduceSum" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/ReduceSum_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/voxel_feature_extractor/ReduceSum/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="36" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="32" name="/voxel_feature_extractor/ReduceSum/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="40" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="33" name="/voxel_feature_extractor/ReduceSum/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="36" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="34" name="/voxel_feature_extractor/ReduceSum/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="40" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="35" name="/voxel_feature_extractor/ReduceSum/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="num_points_per_pillar/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="37" name="num_points_per_pillar/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="44" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="38" name="num_points_per_pillar/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="39" name="num_points_per_pillar/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="44" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="40" name="num_points_per_pillar/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/voxel_feature_extractor/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="48" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/voxel_feature_extractor/Constant_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/voxel_feature_extractor/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12000</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Reshape_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/voxel_feature_extractor/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Div_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/voxel_feature_extractor/Div/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="45" name="/voxel_feature_extractor/Div/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="80" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="46" name="/voxel_feature_extractor/Div/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="47" name="/voxel_feature_extractor/Div/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="80" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="48" name="/voxel_feature_extractor/Div/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/voxel_feature_extractor/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Sub_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/voxel_feature_extractor/Sub/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="51" name="/voxel_feature_extractor/Sub/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="80" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="52" name="/voxel_feature_extractor/Sub/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="53" name="/voxel_feature_extractor/Sub/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="80" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="54" name="/voxel_feature_extractor/Sub/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="x_sub_shaped/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="56" name="x_sub_shaped/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="84" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="57" name="x_sub_shaped/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="58" name="x_sub_shaped/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="84" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="59" name="x_sub_shaped/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/voxel_feature_extractor/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Sub_1_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/voxel_feature_extractor/Sub_1/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="88" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="62" name="/voxel_feature_extractor/Sub_1/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="84" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="63" name="/voxel_feature_extractor/Sub_1/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="88" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="64" name="/voxel_feature_extractor/Sub_1/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="84" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="65" name="/voxel_feature_extractor/Sub_1/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="y_sub_shaped/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="92" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="67" name="y_sub_shaped/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="96" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="68" name="y_sub_shaped/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="92" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="69" name="y_sub_shaped/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="96" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="70" name="y_sub_shaped/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/voxel_feature_extractor/Sub_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Sub_2_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/voxel_feature_extractor/Sub_2/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="92" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="73" name="/voxel_feature_extractor/Sub_2/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="96" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="74" name="/voxel_feature_extractor/Sub_2/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="92" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="75" name="/voxel_feature_extractor/Sub_2/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="96" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="76" name="/voxel_feature_extractor/Sub_2/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/voxel_feature_extractor/Concat_1" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32" names="/voxel_feature_extractor/Concat_1_output_0">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="mask/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="79" name="mask/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="100" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="80" name="mask/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="81" name="mask/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="100" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="82" name="mask/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/voxel_feature_extractor/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/Mul_output_0">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/voxel_feature_extractor/Mul/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="104" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="85" name="/voxel_feature_extractor/Mul/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="86" name="/voxel_feature_extractor/Mul/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="104" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="87" name="/voxel_feature_extractor/Mul/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="88" name="/voxel_feature_extractor/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_22297" type="Const" version="opset1">
			<data element_type="i8" shape="64, 9, 1, 1" offset="108" size="576" />
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Convert_22298" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_22299" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 1" offset="684" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/voxel_feature_extractor/pfn_layers.0/conv1/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/voxel_feature_extractor/pfn_layers.0/conv1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>9</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_36_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="940" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Reshape_36" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/voxel_feature_extractor/pfn_layers.0/conv1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/voxel_feature_extractor/pfn_layers.0/conv1/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/voxel_feature_extractor/pfn_layers.0/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/voxel_feature_extractor/pfn_layers.0/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/voxel_feature_extractor/pfn_layers.0/Relu/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="99" name="/voxel_feature_extractor/pfn_layers.0/Relu/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1068" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="100" name="/voxel_feature_extractor/pfn_layers.0/Relu/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="101" name="/voxel_feature_extractor/pfn_layers.0/Relu/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1068" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="102" name="/voxel_feature_extractor/pfn_layers.0/Relu/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_22302" type="Const" version="opset1">
			<data element_type="i8" shape="64, 64, 1, 34" offset="1072" size="139264" />
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Convert_22303" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_22304" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 1" offset="140336" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/voxel_feature_extractor/pfn_layers.0/conv3/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/voxel_feature_extractor/pfn_layers.0/conv3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 3" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Reshape_53_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="140592" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Reshape_53" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="173" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="173">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="173/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12000</dim>
					<dim>1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="82" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="70" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="59" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="40" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="27" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="22" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="17" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="12" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="9" from-port="0" to-layer="12" to-port="2" />
		<edge from-layer="10" from-port="0" to-layer="12" to-port="3" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="4" />
		<edge from-layer="12" from-port="5" to-layer="77" to-port="0" />
		<edge from-layer="12" from-port="5" to-layer="60" to-port="0" />
		<edge from-layer="12" from-port="5" to-layer="28" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="14" from-port="0" to-layer="17" to-port="2" />
		<edge from-layer="15" from-port="0" to-layer="17" to-port="3" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="4" />
		<edge from-layer="17" from-port="5" to-layer="77" to-port="1" />
		<edge from-layer="17" from-port="5" to-layer="71" to-port="0" />
		<edge from-layer="17" from-port="5" to-layer="28" to-port="1" />
		<edge from-layer="18" from-port="0" to-layer="22" to-port="1" />
		<edge from-layer="19" from-port="0" to-layer="22" to-port="2" />
		<edge from-layer="20" from-port="0" to-layer="22" to-port="3" />
		<edge from-layer="21" from-port="0" to-layer="22" to-port="4" />
		<edge from-layer="22" from-port="5" to-layer="28" to-port="2" />
		<edge from-layer="22" from-port="5" to-layer="77" to-port="2" />
		<edge from-layer="23" from-port="0" to-layer="27" to-port="1" />
		<edge from-layer="24" from-port="0" to-layer="27" to-port="2" />
		<edge from-layer="25" from-port="0" to-layer="27" to-port="3" />
		<edge from-layer="26" from-port="0" to-layer="27" to-port="4" />
		<edge from-layer="27" from-port="5" to-layer="77" to-port="3" />
		<edge from-layer="28" from-port="3" to-layer="49" to-port="0" />
		<edge from-layer="28" from-port="3" to-layer="30" to-port="0" />
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1" />
		<edge from-layer="30" from-port="2" to-layer="35" to-port="0" />
		<edge from-layer="31" from-port="0" to-layer="35" to-port="1" />
		<edge from-layer="32" from-port="0" to-layer="35" to-port="2" />
		<edge from-layer="33" from-port="0" to-layer="35" to-port="3" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="4" />
		<edge from-layer="35" from-port="5" to-layer="43" to-port="0" />
		<edge from-layer="36" from-port="0" to-layer="40" to-port="1" />
		<edge from-layer="37" from-port="0" to-layer="40" to-port="2" />
		<edge from-layer="38" from-port="0" to-layer="40" to-port="3" />
		<edge from-layer="39" from-port="0" to-layer="40" to-port="4" />
		<edge from-layer="40" from-port="5" to-layer="42" to-port="0" />
		<edge from-layer="41" from-port="0" to-layer="42" to-port="1" />
		<edge from-layer="42" from-port="2" to-layer="43" to-port="1" />
		<edge from-layer="43" from-port="2" to-layer="48" to-port="0" />
		<edge from-layer="44" from-port="0" to-layer="48" to-port="1" />
		<edge from-layer="45" from-port="0" to-layer="48" to-port="2" />
		<edge from-layer="46" from-port="0" to-layer="48" to-port="3" />
		<edge from-layer="47" from-port="0" to-layer="48" to-port="4" />
		<edge from-layer="48" from-port="5" to-layer="49" to-port="1" />
		<edge from-layer="49" from-port="2" to-layer="54" to-port="0" />
		<edge from-layer="50" from-port="0" to-layer="54" to-port="1" />
		<edge from-layer="51" from-port="0" to-layer="54" to-port="2" />
		<edge from-layer="52" from-port="0" to-layer="54" to-port="3" />
		<edge from-layer="53" from-port="0" to-layer="54" to-port="4" />
		<edge from-layer="54" from-port="5" to-layer="77" to-port="4" />
		<edge from-layer="55" from-port="0" to-layer="59" to-port="1" />
		<edge from-layer="56" from-port="0" to-layer="59" to-port="2" />
		<edge from-layer="57" from-port="0" to-layer="59" to-port="3" />
		<edge from-layer="58" from-port="0" to-layer="59" to-port="4" />
		<edge from-layer="59" from-port="5" to-layer="60" to-port="1" />
		<edge from-layer="60" from-port="2" to-layer="65" to-port="0" />
		<edge from-layer="61" from-port="0" to-layer="65" to-port="1" />
		<edge from-layer="62" from-port="0" to-layer="65" to-port="2" />
		<edge from-layer="63" from-port="0" to-layer="65" to-port="3" />
		<edge from-layer="64" from-port="0" to-layer="65" to-port="4" />
		<edge from-layer="65" from-port="5" to-layer="77" to-port="5" />
		<edge from-layer="66" from-port="0" to-layer="70" to-port="1" />
		<edge from-layer="67" from-port="0" to-layer="70" to-port="2" />
		<edge from-layer="68" from-port="0" to-layer="70" to-port="3" />
		<edge from-layer="69" from-port="0" to-layer="70" to-port="4" />
		<edge from-layer="70" from-port="5" to-layer="71" to-port="1" />
		<edge from-layer="71" from-port="2" to-layer="76" to-port="0" />
		<edge from-layer="72" from-port="0" to-layer="76" to-port="1" />
		<edge from-layer="73" from-port="0" to-layer="76" to-port="2" />
		<edge from-layer="74" from-port="0" to-layer="76" to-port="3" />
		<edge from-layer="75" from-port="0" to-layer="76" to-port="4" />
		<edge from-layer="76" from-port="5" to-layer="77" to-port="6" />
		<edge from-layer="77" from-port="7" to-layer="83" to-port="0" />
		<edge from-layer="78" from-port="0" to-layer="82" to-port="1" />
		<edge from-layer="79" from-port="0" to-layer="82" to-port="2" />
		<edge from-layer="80" from-port="0" to-layer="82" to-port="3" />
		<edge from-layer="81" from-port="0" to-layer="82" to-port="4" />
		<edge from-layer="82" from-port="5" to-layer="83" to-port="1" />
		<edge from-layer="83" from-port="2" to-layer="88" to-port="0" />
		<edge from-layer="84" from-port="0" to-layer="88" to-port="1" />
		<edge from-layer="85" from-port="0" to-layer="88" to-port="2" />
		<edge from-layer="86" from-port="0" to-layer="88" to-port="3" />
		<edge from-layer="87" from-port="0" to-layer="88" to-port="4" />
		<edge from-layer="88" from-port="5" to-layer="93" to-port="0" />
		<edge from-layer="89" from-port="0" to-layer="90" to-port="0" />
		<edge from-layer="90" from-port="1" to-layer="92" to-port="0" />
		<edge from-layer="91" from-port="0" to-layer="92" to-port="1" />
		<edge from-layer="92" from-port="2" to-layer="93" to-port="1" />
		<edge from-layer="93" from-port="2" to-layer="96" to-port="0" />
		<edge from-layer="94" from-port="0" to-layer="95" to-port="0" />
		<edge from-layer="95" from-port="1" to-layer="96" to-port="1" />
		<edge from-layer="96" from-port="2" to-layer="97" to-port="0" />
		<edge from-layer="97" from-port="1" to-layer="102" to-port="0" />
		<edge from-layer="98" from-port="0" to-layer="102" to-port="1" />
		<edge from-layer="99" from-port="0" to-layer="102" to-port="2" />
		<edge from-layer="100" from-port="0" to-layer="102" to-port="3" />
		<edge from-layer="101" from-port="0" to-layer="102" to-port="4" />
		<edge from-layer="102" from-port="5" to-layer="107" to-port="0" />
		<edge from-layer="103" from-port="0" to-layer="104" to-port="0" />
		<edge from-layer="104" from-port="1" to-layer="106" to-port="0" />
		<edge from-layer="105" from-port="0" to-layer="106" to-port="1" />
		<edge from-layer="106" from-port="2" to-layer="107" to-port="1" />
		<edge from-layer="107" from-port="2" to-layer="110" to-port="0" />
		<edge from-layer="108" from-port="0" to-layer="109" to-port="0" />
		<edge from-layer="109" from-port="1" to-layer="110" to-port="1" />
		<edge from-layer="110" from-port="2" to-layer="111" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2024.3.0-16041-1e3b88e4e3f-releases/2024/3" />
		<conversion_parameters>
			<is_python_object value="False" />
			<output_model value="pfe" />
		</conversion_parameters>
		<nncf>
			<friendly_names_were_updated value="True" />
			<quantization>
				<advanced_parameters value="{}" />
				<fast_bias_correction value="False" />
				<ignored_scope value="None" />
				<model_type value="None" />
				<preset value="None" />
				<subset_size value="300" />
				<target_device value="GPU" />
			</quantization>
		</nncf>
	</rt_info>
</net>
